In [144]:
import pandas as pd

In [145]:
dict1 = {
    'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
            'Marks':[98,89,99,87,90,83,99],
            'Gender':['Male','Female','Female','Male','Male','Female','Female']
        }
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 1. Display Top 3 Rows of the Dataset

In [146]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

### 2. Check Last 3 Rows of the Dataset

In [147]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 3. Find the Shape of Our Dataset (Number of Rows & Columns)

In [148]:
df1.shape

(7, 3)

In [149]:
print('Number of Rows:', df1.shape[0])
print('Number of Columns:', df1.shape[1])

Number of Rows: 7
Number of Columns: 3

In [150]:
df1.dtypes

Name      object
Marks      int64
Gender    object
dtype: object

### 4. Acquire Information About Our Dataset                                              (Total Number of Rows and Columns/ Datatypes/ Non-null Count)

In [151]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### 5. Check Null Values in the Dataset

In [152]:
# axis = 0 (Default): Check by rows / axis = 1: Check by columns
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

### 6. Get Overall Statistics About the Dataframe

In [153]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

### 7. Find Unique Values From the Gender Columns

In [154]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### 8. Find the Number of Unique Values From the Gender Column

In [155]:
df1['Gender'].nunique()

2

### 9. Display Count of Unique Value in the Gender Column

In [156]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### 10. Find the Total Number of Students Having Marks Between 90 and 100 (Inclusive) Using the Between Method

In [157]:
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [158]:
len ( df1[ (df1['Marks'] >= 90) & (df1['Marks'] <= 100) ] )

4

In [159]:
sum(df1['Marks'].between(90,100))

4

### 11. Find Average Marks

In [160]:
# max(), min(), etc.
df1['Marks'].mean()

92.14285714285714

### 12. Apply Method (With lambda x)

In [161]:
def divide_by_five(x):
    return x/5

df1['Marks'].apply(divide_by_five)

0    19.6
1    17.8
2    19.8
3    17.4
4    18.0
5    16.6
6    19.8
Name: Marks, dtype: float64

In [162]:
# Create a New Column
df1['New_Marks'] = df1['Marks'].apply(divide_by_five)
df1

      Name  Marks  Gender  New_Marks
0  Priyang     98    Male       19.6
1   Aadhya     89  Female       17.8
2   Krisha     99  Female       19.8
3   Vedant     87    Male       17.4
4   Parshv     90    Male       18.0
5   Mittal     83  Female       16.6
6  Archana     99  Female       19.8

In [163]:
df1['New_Marks'].apply(lambda x: x*10)

0    196.0
1    178.0
2    198.0
3    174.0
4    180.0
5    166.0
6    198.0
Name: New_Marks, dtype: float64

In [164]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### 13. Map Function

In [165]:
df1['Gender_In_Numbers'] = df1['Gender'].map({'Male':1, 'Female': 0})
df1

      Name  Marks  Gender  New_Marks  Gender_In_Numbers
0  Priyang     98    Male       19.6                  1
1   Aadhya     89  Female       17.8                  0
2   Krisha     99  Female       19.8                  0
3   Vedant     87    Male       17.4                  1
4   Parshv     90    Male       18.0                  1
5   Mittal     83  Female       16.6                  0
6  Archana     99  Female       19.8                  0

### 14. Drop Columns

In [166]:
# Dropping single column
df1.drop('Gender_In_Numbers', axis=1)

      Name  Marks  Gender  New_Marks
0  Priyang     98    Male       19.6
1   Aadhya     89  Female       17.8
2   Krisha     99  Female       19.8
3   Vedant     87    Male       17.4
4   Parshv     90    Male       18.0
5   Mittal     83  Female       16.6
6  Archana     99  Female       19.8

In [170]:
# Dropping Multiple Columns
df1.drop(['New_Marks','Gender_In_Numbers'], axis=1, inplace=True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 15. Print the Name of Columns

In [172]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [173]:
# Range of Rows
df1.index

RangeIndex(start=0, stop=7, step=1)

### 16. Sort the Dataframe

In [185]:
df1.sort_values(['Marks','Name'], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

### 17. Display Name & Marks of Female Students

In [189]:
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [194]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99